import React,{useRef} from "react";
import "bootstrap/dist/css/bootstrap.min.css";
import './App.css';
import Contact from "./Contact"
import {Container,Button,Table } from "react-bootstrap";
import { BrowserRouter,Routes,Route,NavLink } from "react-router-dom";
<style>
import url('https://fonts.googleapis.com/css2?family=Sarabun&display=swap');
</style>
export function Layout() {
  return (
  <nav className="bg-secondary navbar-light text-light">
    <NavLink 
      to="/" 
      className="link px-2"
      style={({ isActive }) => {
        return {
          textDecoration: isActive ? "none" : "underline",
      };
    }}
  >
      หน้าหลัก
    </NavLink>
    <NavLink 
      to="/product"
      className="link px-2"
      style={({ isActive }) => {
        return {
          textDecoration: isActive ? "none" : "underline",
      };
    }}
  >
      ตารางเทียบแคลอรี
      </NavLink>
      <NavLink
        to="/contact"
        className="link px-2"
        style={({ isActive }) => {
          return {
            textDecoration: isActive ? "none" : "underline",
          };
        }}
      >
        ผู้จัดทำ
      </NavLink>
    </nav>
  );
}

function Index() {
  
  return (
  <div>
    <Layout/>

    <p >อาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพตามวิถีภูมิปัญญาท้องถิ่นของจังหวัดอุบลราชธานี </p>
    <img src="card-01.jpg"width="250" height="250" border-radius="20%"/>
    <br></br>
    <h4>เมี่ยงคำกลีบบัวหลวงแบบโบราณ</h4>
    <br></br>
    <p>เมี่ยงคำกลีบบัวหลวง เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ที่มีความประณีตสวยงาม เป็นต้นตำรับเมนูสมุนไพรของคนไทยโบราณที่มีมาช้านานทั้งในเรื่องของรสชาติที่กลมกล่อม เครื่องปรุงล้วนเป็นสมุนไพรจากธรรมชาติ มีคุณค่าทางสมุนไพรสูง เพราะมีคุณสมบัติในการบำรุงรักษาธาตุทั้ง 4 เพื่อให้สมดุลกัน กลีบบัวหลวง มีสีสันสวยงาม มีสรรพคุณบำรุงร่างกาย ห้ามเลือด มีเส้นใยอาหารสูง และกระตุ้นการขับถ่ายเป็นยาสมานแผล ช่วยบำรุงร่างกายบำรุงหัวใจ ลดความดันโลหิตสูง และลดระดับน้ำตาลในเลือดได้ โดยมีเครื่องเคียงที่มีพืชผักสมุนไพรที่ถูกหั่นออกเป็นชิ้นเล็กๆความความประณีตในการหั่น ซอย เครื่อง หัวหอมแดง ขิง พริก มะนาว ต้องหั่นให้เป็นชิ้นสี่เหลี่ยมลูกเต๋าสวยงาม ถั่วลิสงคั่ว แล้วเรียงเม็ดจัดให้เท่ากัน แถมด้วยความกรุบกรอบของมะพร้าวคั่วที่นำเนื้อมะพร้าวแก่แต่ไม่แข็งจนเกินไป นำมาหั่นบางเท่ากัน ก่อนนำไปอบและคั่วด้วยไฟอ่อนๆจนหอมกรุ่นมะพร้าว เป็นสีเหลืองน้ำตาลอ่อน เมื่อห่อรวมกันเข้าแล้ว ราดด้วยน้ำเมี่ยงคำหวาน เวลารับประทานจะได้รสชาติของสมุนไพรพื้นบ้านทุกคำ จึงมีประโยชน์ต่อสุขภาพสูงมาก ลดอัตราเสี่ยงต่อการเกิดโรค เช่น โรคไขมันในเลือดสูง โรคหัวใจและหลอดเลือด โรคความดันโลหิตสูง โรคเบาหวาน เป็นต้น</p>
    <button>เรียนรู้เพิ่มเติม>></button>
    <br></br>
    <br></br>
    <img src="card-05.jpg"width="250" height="250" border-radius="20%"/>
    <br></br>
    <h4>แกงเห็ดเผาะไข่มดแดง</h4>
    <br></br>
    <p>แกงเห็ดเผาะไข่มดแดง เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น โดยการนำเอาทรัพยากรชีวภาพที่มีอยู่ในท้องถิ่นมาปรุงเป็นอาหารพื้นเมือง ที่มีรสชาติกลมกล่อม เป็นอาหารที่ให้คุณค่าทางโภชนาการ เห็ดเผาะมีโปรตีนและแร่ธาตุต่างๆและสรรพคุณทางยาให้ประโยชน์ช่วยบำรุงร่างกาย ลดอาการร้อนใน เนื่องจากมีฤทธิ์เย็น แก้ช้ำใน แก้ไข้ตัวร้อน ช่วยสมานแผล ลดอาการอักเสบและบวม ช่วยทำให้เลือดแข็งตัวได้เร็วขึ้น บรรเทาอาการคันตามร่างกาย และยังมีส่วนช่วยยับยั้งการเกิดเซลล์มะเร็งอีกด้วย ส่วนไข่มดแดง มีประโยชน์ต่อร่างกายมีคุณค่าทางอาหารสูง โดยเฉพาะโปรตีน ฟอสฟอรัส และแคลเซียม และยังมีสรรพคุณทางยาช่วยระบายท้องและเจริญอาหาร และ ผักหวานเป็น ผักพื้นบ้านสมุนไพร มีคุณค่าทางโภชนาการสูง เป็นแหล่งของโปรตีน วิตามินซี เบต้าแคโรทีนซึ่งช่วยในการมองเห็น บำรุงสายตา และมีสรรพคุณเป็นสารต้านอนุมูลอิสระ ช่วยป้องกันโรคมะเร็ง โรคหัวใจขาดเลือด โรคเบาหวานและ โรคความดันโลหิตสูง มี แคลเซียม และฟอสฟอรัสสูง ช่วยบำรุงกระดูก และฟันให้แข็งแรง และมีเส้นใยอาหารช่วยในการขับถ่ายได้ ซึ่งล้วนแล้วแต่มีประโยชน์ของสมุนไพรที่มีสรรพคุณต่อสุขภาพร่างกายแทบทั้งสิ้น</p>
    <button>เรียนรู้เพิ่มเติม>></button>
    <br></br>
    <br></br>
    <img src="card-09.jpg"width="250" height="250" border-radius="20%"/>
    <br></br>
    <h4>แกงอ่อมหอยขม</h4>
    <br></br>
    <p>แกงอ่อมหอยขม เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น เป็นแกงอ่อมอาหารพื้นเมืองที่อุดมไปด้วยคุณค่าทางโภชนาการเพราะส่วนประกอบหลักส่วนใหญ่เป็นผักและสมุนไพรพื้นบ้านนานาชนิดเป็นความผสมผสานที่ลงตัวระหว่างชนิดของอาหาร และเครื่องปรุง มีเสน่ห์ของความเป็นไทย ต้นตำรับเมนูสมุนไพรโบราณที่มีมาช้านานของจังหวัดอุบลราชธานี โดยการนำหอยขมหรือหอยจุ๊บที่อยู่ในแหล่งน้ำตามธรรมชาติ มีคุณค่าทางโภชนาการเป็นแหล่งโปรตีน และคอลาเจน ที่มีประโยชน์ต่อร่างกาย มาแกงผสมผสานเข้ากับน้ำคั้นใบย่านางสีเขียวเข้มที่มีสารต่อต้านอนุมูลอิสระ และมีสรรพคุณ เสริมสร้างภูมิต้านทานโรคในร่างกาย ช่วยขับพิษและลดไข้ ช่วยป้องกันการเกิดโรคหัวใจ ช่วยลดระดับน้ำตาลในเลือด และลดความดันโลหิตสูงได้ ยังมีข้าวเบือ คือ การนำข้าวเหนียวมาแช่น้ำไว้อย่างน้อย 1 ชั่วโมงให้เมล็ดข้าวเหนียวอ่อนนุ่ม สงให้สะเด็ดน้ำ แล้วนำมาโขลกให้ละเอียด ไว้ใส่ในแกงอ่อม ที่ช่วยให้ส่วนผสมน้ำแกงรสเผ็ดร้อนเข้มข้นกลมกล่อม ปรุงรสนัวด้วยน้ำปลาร้า เติมความเผ็ดด้วยพริกสด กลิ่นหอมจากสมุนไพรสดในเครื่องพริกแกงอ่อม ได้แก่ ใบแมงลัก ข่า ตะไคร้ หัวหอม กระเทียม ต้นหอม รวมไปถึงกลิ่นหอมของผักชีลาว ซึ่งเป็นเอกลักษณ์ของแกงอ่อมอีสานรวมอยู่ด้วย ล้วนมีสรรพคุณทางยา มีสารต่อต้านอนุมูลอิสระ ช่วยลดความดันโลหิต ลดไขมันในเลือดได้ดี และยังมีส่วนช่วยกระตุ้นระบบการขับถ่ายให้ทำงานอย่างเป็นปกติอีกด้วย</p>
    <button>เรียนรู้เพิ่มเติม>></button>
    <br></br>
  </div>
  );
}

function Product() {
  const table = useRef();
  const tr = useRef([]);
  const DeleteRow = (i) => {
    const index = tr.current[i].rowIndex;
    table.current.deleteRow(index);
  }
  const data = [
    ["เมี่ยงคำกลีบบัวหลวงแบบโบราณ",250],
    ["แกงเห็ดเผาะไข่มดแดง",200],
    ["แกงอ่อมหอยขม",300]
  
  ];
  

  return (
    <>
      <Layout/>
      <h4>ตารางเทียบแคลอรี</h4>
      <Table striped bordered hover className="my-3"ref={table}>
        <thead>
          <tr>
            <th>เมนูอาหาร</th>
            <th>พลังงานที่ได้รับ</th>
            <th>เลือกเมนู</th>
          </tr>
        </thead>
        <tbody>
          {data.map((item,i) => {
            return (
              <tr 
                ref={(el) => {
                  tr.current[i] = el;
                }} 
                key={i}
              >
                <td>{item[0]}</td>
                <td>{item[1]}</td>
                <td className="text-center"><Button variant="primary" onclick="Index()">
                  เลือกเมนู
                  </Button></td>
              </tr>
            );
          })}
        </tbody>
      </Table>
    </>
  );
}
function App() {
  return (
    <BrowserRouter>
    <Container className="p-3 my-3 bg-light">
      <Routes>
        <Route path="/" element={<Index />} />
        <Route path="/main" element={<Index />} />
        <Route path="/product" element={<Product />} />
        <Route path="/contact" element={<Contact/>} />
      </Routes>
    </Container>
    </BrowserRouter>
  );
}

export default App;
